In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

C:\Users\Arjun Janamatti\Anaconda3\envs\tf_nptel\lib\site-packages\numpy\core\__init__.py:29: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\Arjun Janamatti\Anaconda3\envs\tf_nptel\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
C:\Users\Arjun Janamatti\Anaconda3\envs\tf_nptel\lib\site-packages\numpy\.libs\libopenblas.TXA6YQSD3GCQQC22GEQ54J2UDCXDXHWN.gfortran-win_amd64.dll
  stacklevel=1)

In [2]:
raw_df = pd.read_csv('C:/Users/Arjun Janamatti/Downloads/gapminder-FiveYearData(1).csv')
print(f'Shape of dataframe: {raw_df.shape}')
print(f'Number of rows in dataframe: {raw_df.shape[0]}')
print(f'Number of columns in dataframe: {raw_df.shape[1]}')

Shape of dataframe: (1704, 6)
Number of rows in dataframe: 1704
Number of columns in dataframe: 6

In [3]:
raw_df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [4]:
print(f'Column names: {raw_df.columns}')

Column names: Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [5]:
print('DATA TYPE OF EACH COLUMN')
raw_df.dtypes

DATA TYPE OF EACH COLUMN

country       object
year           int64
pop          float64
continent     object
lifeExp      float64
gdpPercap    float64
dtype: object

In [6]:
print('INFO ABOUT EACH COLUMN')
raw_df.info()

INFO ABOUT EACH COLUMN
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   year       1704 non-null   int64
 2   pop        1704 non-null   float64
 3   continent  1704 non-null   object
 4   lifeExp    1704 non-null   float64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 80.0+ KB

In [7]:
print('get the country column and saving as a variable, THIS IS SERIES')
var_1 = raw_df['country']
var_1

get the country column and saving as a variable, THIS IS SERIES

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [8]:
print('get more than one column at a time and saving as a variable, THIS IS DATAFRAME')
var_2 = raw_df[['country', 'pop', 'lifeExp']]
var_2

get more than one column at a time and saving as a variable, THIS IS DATAFRAME

          country         pop  lifeExp
0     Afghanistan   8425333.0   28.801
1     Afghanistan   9240934.0   30.332
2     Afghanistan  10267083.0   31.997
3     Afghanistan  11537966.0   34.020
4     Afghanistan  13079460.0   36.088
...           ...         ...      ...
1699     Zimbabwe   9216418.0   62.351
1700     Zimbabwe  10704340.0   60.377
1701     Zimbabwe  11404948.0   46.809
1702     Zimbabwe  11926563.0   39.989
1703     Zimbabwe  12311143.0   43.487

[1704 rows x 3 columns]

In [9]:
print('below will select 1st, 100th and 1000th rows in above dataframe')
raw_df.loc[[0,99,999]]

below will select 1st, 100th and 1000th rows in above dataframe

         country  year         pop continent  lifeExp    gdpPercap
0    Afghanistan  1952   8425333.0      Asia   28.801   779.445314
99    Bangladesh  1967  62821884.0      Asia   43.453   721.186086
999     Mongolia  1967   1149500.0      Asia   51.253  1226.041130

In [10]:
 print('With iloc, we can pass -1 to get the details of last row, whereas in loc this is not possible')

With iloc, we can pass -1 to get the details of last row, whereas in loc this is not possible

In [11]:
raw_df.iloc[-1]

country         Zimbabwe
year                2007
pop          1.23111e+07
continent         Africa
lifeExp           43.487
gdpPercap        469.709
Name: 1703, dtype: object

In [12]:
raw_df.loc[len(raw_df)-1]

country         Zimbabwe
year                2007
pop          1.23111e+07
continent         Africa
lifeExp           43.487
gdpPercap        469.709
Name: 1703, dtype: object

In [13]:
print('below will select 1st, 100th and 1000th rows in above dataframe')
raw_df.iloc[[0,99,999]]

below will select 1st, 100th and 1000th rows in above dataframe

         country  year         pop continent  lifeExp    gdpPercap
0    Afghanistan  1952   8425333.0      Asia   28.801   779.445314
99    Bangladesh  1967  62821884.0      Asia   43.453   721.186086
999     Mongolia  1967   1149500.0      Asia   51.253  1226.041130

In [16]:
raw_df.loc[:, ['year', 'pop']]

      year         pop
0     1952   8425333.0
1     1957   9240934.0
2     1962  10267083.0
3     1967  11537966.0
4     1972  13079460.0
...    ...         ...
1699  1987   9216418.0
1700  1992  10704340.0
1701  1997  11404948.0
1702  2002  11926563.0
1703  2007  12311143.0

[1704 rows x 2 columns]

In [17]:
raw_df.iloc[:, [1, 2]]

      year         pop
0     1952   8425333.0
1     1957   9240934.0
2     1962  10267083.0
3     1967  11537966.0
4     1972  13079460.0
...    ...         ...
1699  1987   9216418.0
1700  1992  10704340.0
1701  1997  11404948.0
1702  2002  11926563.0
1703  2007  12311143.0

[1704 rows x 2 columns]